ctRobotNamePoolConf={}
ctRobotNamePoolConf[1]={nIndex=1,tXing={{"安",},{"柏",},{"鲍",},{"毕",},{"曹",},{"岑",},{"昌",},{"常",},{"丁",},{"傅",},{"郝",},{"赫",},{"华",},{"姜",},{"解",},{"雷",},{"廉",},},tMing={{"之玉",},{"越泽",},{"锦程",},{"修杰",},{"烨伟",},{"尔曼",},{"立辉",},{"致远",},{"天思",},},}
ctRobotNamePoolConf[2]={nIndex=2,tXing={{"安",},{"柏",},{"鲍",},{"毕",},{"曹",},{"岑",},{"昌",},{"常",},{"丁",},{"酆",},{"傅",},{"郝",},{"赫",},{"华",},},tMing={{"醉易",},{"紫萱",},{"紫霜",},{"紫南",},{"紫菱",},{"紫蓝",},{"紫翠",},{"紫安",},{"姿",},{"芷天",},{"芷容",},},}
ctRobotNamePoolConf[3]={nIndex=3,tXing={{"孙",},{"安",},{"乔",},{"梅",},{"欧阳",},{"西门",},{"南宫",},{"夏侯",},{"诸葛",},{"司马",},},tMing={{"小墨",},{"墨尘",},{"小林",},{"小雨",},{"小宇",},{"小羽",},{"小渔",},{"小煜",},{"潇雨",},},}
ctRobotNamePoolConf[4]={nIndex=4,tXing={{"冷",},{"洛",},{"安",},{"丹",},{"休",},{"乔",},{"梅",},{"慕容",},{"欧阳",},{"南宫",},},tMing={{"莎",},{"莎",},{"蕊",},{"泪",},{"梦",},{"汐",},{"梅",},{"琳",},{"珍",},{"琴",},{"乔",},{"琼",},},}
ctRobotNamePoolConf[5]={nIndex=5,tXing={{"栀璃",},{"柔若",},{"柠夏",},{"叛逆",},{"酒笙",},{"后会",},{"月下",},},tMing={{"鸢年",},{"温凉",},{"初开",},{"小青年",},{"倾凉",},{"无期",},{"独酌",},{"倾城",},{"夏沫",},{"倾寒",},{"流年",},},}
