ctHZDialogConf={}
ctHZDialogConf[1]={nIndex=1,sAge="婴儿阿哥",tDialog={{"呜哇，呜哇~~~",},},}
ctHZDialogConf[2]={nIndex=2,sAge="婴儿格格",tDialog={{"呜哇，呜哇~~~",},},}
ctHZDialogConf[3]={nIndex=3,sAge="少年阿哥",tDialog={{"皇阿玛，陪我玩",},{"皇阿玛，上完课，我可以出去玩吗？",},{"我要坚持把这本书读完",},{"皇阿玛，可以陪陪我吗？",},{"皇阿玛，我想和你一起玩",},{"皇阿玛，我会用功读书的",},{"我也要成为像皇阿玛这般伟大的皇帝",},{"君子之行，静以修身，俭以养德……",},{"皇阿玛可以带我骑马吗？",},{"皇阿玛快跟我来！",},{"皇阿玛，我能带你去一个地方吗？",},{"皇阿玛，不知我今天可有做对？",},{"皇阿玛，我有些不安",},{"皇阿玛，究竟怎样才能成为一代明君呢？",},{"皇阿玛快看，这是宫女姐姐给我的花",},{"皇阿玛，我好想吃冰糖葫芦",},{"皇阿玛，可以帮我检查下作业吗？",},{"皇阿玛，今天老师很不开心",},{"皇阿玛，我是不是又做错了？",},{"皇阿玛是我最尊敬的人！",},},}
ctHZDialogConf[4]={nIndex=4,sAge="少年格格",tDialog={{"皇阿玛，我要吃糖",},{"嘻嘻，这个花漂亮吗？",},{"我们一起玩翻花绳好不好",},{"皇阿玛，快看，这是宫女姐姐送给我的小花儿",},{"我最喜欢皇阿玛了",},{"皇阿玛，抱抱",},{"皇阿玛，我想睡觉",},{"皇阿玛，这道题该怎么做？",},{"皇阿玛，我也想骑马",},{"皇阿玛，这么做是不对的吗？",},{"皇阿玛，什么叫如意郎君呢？",},{"皇阿玛，我好无聊",},{"皇阿玛，能陪我聊聊天吗？",},{"皇阿玛是我最喜欢的人！",},{"皇阿玛，我想看烟花",},{"皇阿玛，怎样才能让大家喜欢我呢？",},{"皇阿玛，给我讲故事好不好嘛~",},{"皇阿玛，我唱歌给你听",},{"皇阿玛下次什么时候来看我呢？",},{"皇阿玛，今天可以陪我玩吗？",},},}
ctHZDialogConf[5]={nIndex=5,sAge="成年阿哥",tDialog={{"为百姓立命，为万世开太平！",},{"身为皇子，本殿更应守心克己！",},},}
ctHZDialogConf[6]={nIndex=6,sAge="成年格格",tDialog={{"听说我要嫁人了，不知我的郎君是何人？",},{"听说皇阿玛要为我赐婚，有点小期待",},},}
