gtAchieDef = {
eCond1 = 1, --累计登陆天数
eCond2 = 2, --官品等级（官品达到品）
eCond3 = 3, --势力（势力达到xxx）
eCond4 = 4, --知己数量（拥有知己数量达到xx）
eCond5 = 5, --关卡胜利次数（累计胜利次数）
eCond6 = 6, --征收银两次数
eCond7 = 7, --征收文化次数
eCond8 = 8, --征收势力次数
eCond9 = 9, --处理私信次数
eCond10 = 10, --VIP等级

eCond11 = 11, --知己出使次数
eCond12 = 12, --三生殿结缘次数
eCond13 = 13, --累计抽奖次数(理藩院)
eCond14 = 14, --累计寻访次数
eCond15 = 15, --累计宠物数量
eCond16 = 16, --累计联姻次数
eCond17 = 17, --累计寻宝次数
eCond18 = 18, --联盟建设次数
eCond19 = 19, --累计赴宴次数
eCond20 = 20, --累计游玩次数(寝宫)
eCond21 = 21, --时装数量
eCond22 = 22, --千灯祈福次数
}
