--主线任务类型
gtMainTaskType = 
{
eCond1	=	1	,  --	 前往兴圣宫界面（领取任务后，前往兴圣宫界面）
eCond2	=	2	,  --	 X件时装达到YY级
eCond3	=	3	,  --	 X名知己达到YY级
eCond4	=	4	,  --	 给宠物赐名（领取任务后，给宠物赐名）
eCond5	=	5	,  --	 创建角色以来累计私信次数
eCond6	=	6	,  --	 某某知己达到X级
eCond7	=	7	,  --	 创建角色以来累计征收银两次数
eCond8	=	8	,  --	 创建角色以来累计征收文化次数
eCond9	=	9	,  --	 创建角色以来累计征收士兵次数
eCond10	=	10	,  --	 通关某某关卡
eCond11	=	11	,  --	 创建角色以来累计膜拜次数
eCond12	=	12	,  --	 创建角色以来累计游玩次数（所有知己游玩次数叠加）
eCond13	=	13	,  --	 创建角色以来累计邀约次数
eCond14	=	14	,  --	 创建角色以来累计觅缘次数（元宝选秀与体力选秀次数叠加） 
eCond15	=	15	,  --	 某某时装达到X级
eCond16	=	16	,  --	 创建角色以来累计签到次数
eCond17	=	17	,  --	 创建角色以来累计培养宠物次数
eCond18	=	18	,  --	 创建角色以来累计恢复活力次数（即使用活力丹次数）
eCond19	=	19	,  --	 创建角色以来累计恢复姻缘点次数（即使用姻缘石)
eCond20	=	20	,  --	 创建角色以来累计恢复精力次数(太子妃没有)
eCond21	=	21	,  --	 创建角色以来累计寻访次数
eCond22	=	22	,  --	 创建角色以来累计寻宝次数
eCond23	=	23	,  --	 创建角色以来累计宫斗次数(大清军机处)
eCond24	=	24	,  --	 创建角色以来累计宠物数（包括婴儿、少年、成年）
eCond25	=	25	,  --	 创建角色以来势力达到X
eCond26	=	26	,  --	 创建角色以来累计知己封爵次数
eCond27	=	27	,  --	 创建角色以来累计宠物联姻次数
eCond28	=	28	,  --	 创建角色以来累计知己培养次数（所有名臣培养次数叠加）
eCond29	=	29	,  --	 宠物席位达到X个
eCond30	=	30	,  --	 创建角色以来累计知己送礼次数（所有知己送礼次数叠加）
eCond31	=	31	,  --	 某某知己爵位达到X爵
eCond32	=	32	,  --	 前往联盟界面
eCond33	=	33	,  --	 招募某某知己
eCond34	=	34	,  --	 创建角色以来使用X次宠物加速（使用道具或使用元宝都算）
eCond35	=	35	,  --	 创建角色以来累计赏赐知己次数（所有知己赏赐次数叠加）
eCond36	=	36	,  --	 累计参加时装大赛X次 fix pd
eCond37	=	37	,  --	 太子妃品级达到X(大清皇帝等级)
eCond38	=	38	,  --	 累计天灯祈福X次
eCond39	=	39	,  --	 某某知己晋升X次（激活天赋的晋升）
eCond40	=	40	,  --	 升级知己技能X次
eCond41	=	41	,  --	 通关据点数
eCond42	=	42	,  --	 资质突破成功X次
eCond43 = 	43 	,  --	 累计讨教次数
eCond44 = 	44 	,  --	 选礼次数(大清理藩院)
eCond45 = 	45 	,  --	 所有时装累计进阶次数
eCond46 = 	46 	,  --	 所有时装累计强化次数
eCond47 = 	47	,  --	 制作某某时装
eCond48 = 	48	,  --	 御花园扩建次数(大清寝宫)
}

--日常任务类型
gtDailyTaskType = 
{
eCond1 = 1, --每日充值	
eCond2 = 2, --领取月卡	
eCond3 = 3, --知己升级	
eCond4 = 4, --征收银两	
eCond5 = 5, --征收文化	
eCond6 = 6, --征收兵力	
eCond7 = 7, --处理私信	
eCond8 = 8, --通关据点数
eCond9 = 9, --每日膜拜	
eCond10 = 10, --每日讨教	
eCond11 = 11, --培养知己(每日使用资质果)
eCond12 = 12, --知己游玩(对应大清寝宫)
eCond13 = 13, --培养宠物	
eCond14 = 14, --每日寻访
eCond15 = 15, --随机抽选(对应大清理藩院)
eCond16 = 16, --联盟建设	
eCond17 = 17, --宫斗次数(对应大清军机处)
eCond18 = 18, --每日赴宴

eCond19 = 19, --领取季卡
eCond20 = 20, --强化时装
eCond21 = 21, --天灯祈福
eCond22 = 22, --时装升级
}


gtTaskState = 
{
	eInit = 0,		--初始
	eFinish = 1,	--完成
	eClosed = 2,	--已领取
}
