ctChuangGuanShowConf={}
ctChuangGuanShowConf[1]={nType=1,sName="踏仙桥",tRewardXiaYiPer={{100,10,},},tGuanQia={{20,},{100,},{150,},},tRew={{50000,},{50005,},{33151,},},nNum={{80,},{80,},{10,},},sText={{"仙侣",},{"仙侣",},{"破魔刃",},},}
ctChuangGuanShowConf[2]={nType=2,sName="幽冥河",tRewardXiaYiPer={{100,10,},},tGuanQia={{3,},{5,},{7,},{10,},{12,},{15,},},tRew={{33171,},{13600,},{33171,},{33171,},{33171,},{33171,},},nNum={{10,},{1,},{10,},{10,},{10,},{10,},},sText={{"神器灭度杖",},{"宠物",},},}
ctChuangGuanShowConf[3]={nType=3,sName="血色试炼",tRewardXiaYiPer={{100,10,},},tGuanQia={{30,},{50,},{60,},{70,},{80,},{90,},{100,},},tRew={{33141,},{33151,},{33141,},{33151,},{33141,},{33151,},{33141,},},nNum={{10,},{10,},{10,},{10,},{10,},{10,},{10,},},sText={{"神器风火扇",},{"神器破魔刃",},},}
